In [1]:
import pandas as pd
import numpy as np

In [3]:
arr = np.array([4,3,-1,2,5])
arr

array([ 4,  3, -1,  2,  5])

In [4]:
np.var(arr)

4.24

In [5]:
np.std(arr)

2.0591260281974

In [6]:
arr.max()

5

In [7]:
arr.min()

-1

In [8]:
range_arr = arr.max() - arr.min()
range_arr

6

In [9]:
iqr = np.percentile(arr, 75) - np.percentile(arr, 25)
iqr

2.0

In [10]:
df = pd.read_csv("../data/titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
df['Age'].mean()

30.272590361445783

In [12]:
df['Age'].std()

14.181209235624422

In [13]:
df['Age'].var()

201.10669538455943

In [14]:
df['Age'].max()

76.0

In [15]:
df['Age'].min()

0.17

In [16]:
iqr = df['Age'].quantile(.75) - df['Age'].quantile(.25)
iqr

18.0